"""Сопоставление полученных в ходе парсинга праметров с нужными id из базы данных """

category_mapping = {'Одежда': 1, 'Обувь': 2, 'Аксессуары': 3}
subtype_mapping = {"Куртки": 1, "Толстовки": 2, "Брюки": 3, "Футболки и майки": 4, "Шорты": 5, "Кроссовки": 6, "Кеды": 7,
                   "Тапочки": 8, "Сланцы": 9, "Ботинки": 10, "Кепки": 11, "Шапки": 12, "Носки": 13,
                   "Рюкзаки": 14, "Сумки": 15,
                   }
brand_mapping = {"Nike": 1, "Puma": 2, "Vans": 3, "The North Face": 4, "Jordan": 5, "New Balance": 5, "Napapijri": 6}


filename_mapping = {1: "odezhda", 2: "obuv", 3: "aksessuary"}


